let listsConfig = {
    technicalList: [
        "Нереалістичні функціональні характеристики ПЗ",
        "Нереалістичні характеристики якості ПЗ",
        "Нереалістичні характеристики надійності ПЗ",
        "Нереалістична застосовність ПЗ",
        "Нереалістична часова продуктивність ПЗ",
        "Нереалістична супроводжуваність ПЗ",
        "Нереалістичне повторне використання компонент ПЗ"
    ],
    costList: [
        "Присутність обмеження сумарного бюджету на програмний проект",
        "Недоступна вартість реалізації програмного проекту",
        "Низький ступінь реалізму при оцінюванні витрат на програмний проект"
    ],
    managementList: [
        "Нереалістичні властивості та можливості гнучкості внесення змін до планів ЖЦПЗ",
        "Нереалістичні можливості порушення встановлених термінів реалізації етапів ЖЦПЗ",
        "Низький ступінь реалізму при встановленні планів і етапів ЖЦПЗ"
    ],
    planningList: [
        "Наявність хибних стратегій реалізації програмного проекту",
        "Неефективне планування проекту розроблення ПЗ",
        "Неякісне оцінювання програмного проекту",
        "Прогалини в документуванні етапів реалізації програмного проекту",
        "Промахи в прогнозуванні результатів реалізації програмного проекту"
    ],
    technicalPotentialRiskList: [
        "Затримки у постачанні обладнання",
        "Затримки у постачанні інструментальних засобів",
        "Небажання команди виконавців ПЗ використовувати інструментальних засобів",
        "Відмова команди виконавців від CASE-засобів розроблення ПЗ",
        "Формування запитів на більш потужні інструментальні засоби розроблення ПЗ",
        "Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ",
        "Повторно використані програмні компоненти мають дефекти та обмежені функціональні можливості",
        "Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ",
        "Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ",
        "Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів",
        "Поява дефектних системних компонент, які використовують для розроблення ПЗ"
    ],
    costPotentialRiskList: [
        "Недооцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)",
        "Переоцінювання витрат на реалізацію програмного проекту (надмірно висока вартість)",
        "Фінансові ускладнення у компанії-замовника ПЗ",
        "Фінансові ускладнення у компанії-розробника ПЗ",
        "Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації",
        "Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації",
        "Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ",
        "Реорганізація структурних підрозділів у компанії-замовника ПЗ",
        "Реорганізація команди виконавців у компанії-розробника ПЗ"
    ],
    planningPotentialRiskList: [
        "Зміни графіка виконання робіт з боку замовника чи виконавця",
        "Порушення графіка виконання робіт у компанії-розробника ПЗ",
        "Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ",
        "Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ",
        "Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ",
        "Недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ",
        "Переоцінювання тривалості етапів реалізації програмного проекту",
        "Остаточний розмір ПЗ перевищує заплановані його характеристики",
        "Остаточний розмір ПЗ значно менший за планові його характеристики",
        "Поява на ринку аналогічного ПЗ до виходу замовленого",
        "Поява на ринку більш конкурентоздатного ПЗ"
    ],
    managementPotentialRiskList: [
        "Низький моральний стан персоналу команди виконавців ПЗ",
        "Низька взаємодія між членами команди виконавців ПЗ",
        "Пасивність керівника (менеджера) програмного проекту",
        "Недостатня компетентність керівника (менеджера) програмного проекту",
        "Незадоволеність замовника результатами етапів реалізації програмного проекту",
        "Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем",
        "Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ",
        "Одночасна хвороба декількох виконавців підчас розроблення ПЗ",
        "Неможливість організації необхідного навчання персоналу команди виконавців ПЗ",
        "Зміна пріоритетів у процесі управління програмним проектом",
        "Недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
        "Переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ",
        "Надмірне документування результатів на етапах реалізації програмного проекту",
        "Недостатнє документування результатів на етапах реалізації програмного проекту",
        "Нереалістичне прогнозування результатів на етапах реалізації програмного проекту",
        "Недостатній професійний рівень представників від компанії-замовника ПЗ"
    ]
}

export default listsConfig;