import RiskProbabilityTable from "./RiskProbabilityTable";

function tableData() {
    this.tableHeader = ["Ризик", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "ER", "LRER", "VRER",  "Пріоритет"];
    this.tableBody = [
        ["Затримки у постачанні обладнання"],
        ["Затримки у постачанні інструментальних засобів"],
        ["Небажання команди виконавців ПЗ використовувати інструментальних засобів"],
        ["Відмова команди виконавців від CASE-засобів розроблення ПЗ"],
        ["Формування запитів на більш потужні інструментальні засоби розроблення ПЗ"],
        ["Недостатня продуктивність баз(и) даних для підтримки процесу розроблення ПЗ"],
        ["Повторно використані програмні компоненти мають дефекти та обмежені функціональні можливості"],
        ["Неефективність програмного коду, згенерованого CASE-засобами розроблення ПЗ"],
        ["Неможливість інтеграції CASE-засобів з іншими інструментальними засобами для підтримки процесу розроблення ПЗ"],
        ["Швидкість виявлення дефектів у програмному коді є нижчою від раніше запланованих термінів"],
        ["Поява дефектних системних компонент, які використовують для розроблення ПЗ"],
        ["Недооцінювання витрат на реалізацію програмного проекту (надмірно низька вартість)"],
        ["Переоцінювання витрат на реалізацію програмного проекту (надмірно висока вартість)"],
        ["Фінансові ускладнення у компанії-замовника ПЗ"],
        ["Фінансові ускладнення у компанії-розробника ПЗ"],
        ["Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації"],
        ["Збільшення бюджету програмного проекта з ініціативи компанії-розробника ПЗ під час його реалізації"],
        ["Висока вартість виконання повторних робіт, необхідних для зміни вимог до ПЗ"],
        ["Реорганізація структурних підрозділів у компанії-замовника ПЗ"],
        ["Реорганізація команди виконавців у компанії-розробника ПЗ"],
        ["Зміни графіка виконання робіт з боку замовника чи виконавця"],
        ["Порушення графіка виконання робіт у компанії-розробника ПЗ"],
        ["Потреба зміни користувацьких вимог до ПЗ з боку компанії-замовника ПЗ"],
        ["Потреба зміни функціональних вимог до ПЗ з боку компанії-розробника ПЗ"],
        ["Потреба виконання великої кількості повторних робіт, необхідних для зміни вимог до ПЗ"],
        ["Недооцінювання тривалості етапів реалізації програмного проекту з боку компанії-розробника ПЗ"],
        ["Переоцінювання тривалості етапів реалізації програмного проекту"],
        ["Остаточний розмір ПЗ перевищує заплановані його характеристики"],
        ["Остаточний розмір ПЗ значно менший за планові його характеристики"],
        ["Поява на ринку аналогічного ПЗ до виходу замовленого"],
        ["Поява на ринку більш конкурентоздатного ПЗ"],
        ["Низький моральний стан персоналу команди виконавців ПЗ"],
        ["Низька взаємодія між членами команди виконавців ПЗ"],
        ["Пасивність керівника (менеджера) програмного проекту"],
        ["Недостатня компетентність керівника (менеджера) програмного проекту"],
        ["Незадоволеність замовника результатами етапів реалізації програмного проекту"],
        ["Недостатня кількість фахівців у команді виконавців ПЗ з необхідним професійним рівнем"],
        ["Хвороба провідного виконавця в найкритичніший момент розроблення ПЗ"],
        ["Одночасна хвороба декількох виконавців підчас розроблення ПЗ"],
        ["Неможливість організації необхідного навчання персоналу команди виконавців ПЗ"],
        ["Зміна пріоритетів у процесі управління програмним проектом"],
        ["Недооцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ"],
        ["Переоцінювання необхідної кількості розробників (підрядників і субпідрядників) на етапах життєвого циклу розроблення ПЗ"],
        ["Надмірне документування результатів на етапах реалізації програмного проекту"],
        ["Недостатнє документування результатів на етапах реалізації програмного проекту"],
        ["Нереалістичне прогнозування результатів на етапах реалізації програмного проекту"],
        ["Недостатній професійний рівень представників від компанії-замовника ПЗ"]
    ]
}

function createTableWithSolution(solution) {
    let riskTable = new tableData();

    for (let i = 0; i < riskTable.tableBody.length; i++) {
        riskTable.tableBody[i].push(solution);   
    }

    return riskTable;
}

function createTableData(scale) {
    let table = new tableData();
    let riskTable = new RiskProbabilityTable(47, 10, scale);
    riskTable.generate();

    console.log(table.tableBody.length);
    
    for (let i = 0; i < riskTable.rowCount; i++) {
        for (let j = 0; j < riskTable.columnCount + 4; j++) {
            table.tableBody[i].push(riskTable.data[i][j]);
        }
    }

    return table;
}

export {tableData, createTableData, createTableWithSolution};